{"format": "graph-model", "generatedBy": "2.4.1", "convertedBy": "TensorFlow.js Converter v3.3.0", "signature": {"inputs": {"input_3:0": {"name": "input_3:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1024"}, {"size": "64"}]}}, "input_1:0": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1024"}, {"size": "64"}]}}, "input_2:0": {"name": "input_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1024"}, {"size": "64"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1024"}, {"size": "64"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/model/linear_attention_head/Equal", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {"dim": [{"size": "1024"}, {"size": "64"}]}}}, "dtype": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/model/linear_attention_head/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense/Tensordot/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/linear_attention_head/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/model/linear_attention_head/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense_1/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense_1/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense_1/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense_1/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense_1/Tensordot/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/linear_attention_head/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense_1/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense_1/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense_1/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense_1/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1024"}, {"size": "64"}]}}}}, {"name": "input_2", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1024"}, {"size": "64"}]}}}}, {"name": "input_3", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1024"}, {"size": "64"}]}}}}, {"name": "StatefulPartitionedCall/model/linear_attention_head/transpose", "op": "Transpose", "input": ["input_2", "StatefulPartitionedCall/model/linear_attention_head/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/linear_attention_head/transpose_1", "op": "Transpose", "input": ["input_3", "StatefulPartitionedCall/model/linear_attention_head/transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense/Tensordot/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model/linear_attention_head/transpose"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense_1/Tensordot/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model/linear_attention_head/transpose_1"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["StatefulPartitionedCall/model/linear_attention_head/dense/Tensordot/Shape", "StatefulPartitionedCall/model/linear_attention_head/dense/Tensordot/axes", "StatefulPartitionedCall/model/linear_attention_head/dense/Tensordot/GatherV2_1/axis"], "attr": {"batch_dims": {"i": "0"}, "Tparams": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense/Tensordot/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/model/linear_attention_head/dense/Tensordot/Shape", "StatefulPartitionedCall/model/linear_attention_head/dense/Tensordot/free", "StatefulPartitionedCall/model/linear_attention_head/dense/Tensordot/GatherV2/axis"], "attr": {"batch_dims": {"i": "0"}, "Tparams": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense_1/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["StatefulPartitionedCall/model/linear_attention_head/dense_1/Tensordot/Shape", "StatefulPartitionedCall/model/linear_attention_head/dense_1/Tensordot/axes", "StatefulPartitionedCall/model/linear_attention_head/dense_1/Tensordot/GatherV2_1/axis"], "attr": {"Tparams": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense_1/Tensordot/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/model/linear_attention_head/dense_1/Tensordot/Shape", "StatefulPartitionedCall/model/linear_attention_head/dense_1/Tensordot/free", "StatefulPartitionedCall/model/linear_attention_head/dense_1/Tensordot/GatherV2/axis"], "attr": {"batch_dims": {"i": "0"}, "Tparams": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense/Tensordot/Prod_1", "op": "Prod", "input": ["StatefulPartitionedCall/model/linear_attention_head/dense/Tensordot/GatherV2_1", "StatefulPartitionedCall/model/linear_attention_head/dense/Tensordot/Const_1"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense/Tensordot/Prod", "op": "Prod", "input": ["StatefulPartitionedCall/model/linear_attention_head/dense/Tensordot/GatherV2", "StatefulPartitionedCall/model/linear_attention_head/dense/Tensordot/Const"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense/Tensordot/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model/linear_attention_head/dense/Tensordot/GatherV2", "StatefulPartitionedCall/model/linear_attention_head/dense/Tensordot/Const_2", "StatefulPartitionedCall/model/linear_attention_head/dense/Tensordot/concat_1/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense_1/Tensordot/Prod_1", "op": "Prod", "input": ["StatefulPartitionedCall/model/linear_attention_head/dense_1/Tensordot/GatherV2_1", "StatefulPartitionedCall/model/linear_attention_head/dense_1/Tensordot/Const_1"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense_1/Tensordot/Prod", "op": "Prod", "input": ["StatefulPartitionedCall/model/linear_attention_head/dense_1/Tensordot/GatherV2", "StatefulPartitionedCall/model/linear_attention_head/dense_1/Tensordot/Const"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense_1/Tensordot/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model/linear_attention_head/dense_1/Tensordot/GatherV2", "StatefulPartitionedCall/model/linear_attention_head/dense_1/Tensordot/Const_2", "StatefulPartitionedCall/model/linear_attention_head/dense_1/Tensordot/concat_1/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense/Tensordot/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model/linear_attention_head/dense/Tensordot/Prod", "StatefulPartitionedCall/model/linear_attention_head/dense/Tensordot/Prod_1"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense_1/Tensordot/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model/linear_attention_head/dense_1/Tensordot/Prod", "StatefulPartitionedCall/model/linear_attention_head/dense_1/Tensordot/Prod_1"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense/Tensordot/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/model/linear_attention_head/transpose", "StatefulPartitionedCall/model/linear_attention_head/dense/Tensordot/stack"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense_1/Tensordot/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/model/linear_attention_head/transpose_1", "StatefulPartitionedCall/model/linear_attention_head/dense_1/Tensordot/stack"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense/Tensordot/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/model/linear_attention_head/dense/Tensordot/Reshape", "StatefulPartitionedCall/model/linear_attention_head/dense/Tensordot/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense_1/Tensordot/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/model/linear_attention_head/dense_1/Tensordot/Reshape", "StatefulPartitionedCall/model/linear_attention_head/dense_1/Tensordot/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense/Tensordot", "op": "Reshape", "input": ["StatefulPartitionedCall/model/linear_attention_head/dense/Tensordot/MatMul", "StatefulPartitionedCall/model/linear_attention_head/dense/Tensordot/concat_1"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense_1/Tensordot", "op": "Reshape", "input": ["StatefulPartitionedCall/model/linear_attention_head/dense_1/Tensordot/MatMul", "StatefulPartitionedCall/model/linear_attention_head/dense_1/Tensordot/concat_1"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/linear_attention_head/MatMul", "op": "BatchMatMulV2", "input": ["input_1", "StatefulPartitionedCall/model/linear_attention_head/dense/Tensordot"], "attr": {"adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}, "adj_y": {"b": false}}}, {"name": "StatefulPartitionedCall/model/linear_attention_head/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/model/linear_attention_head/MatMul", "ConstantFolding/StatefulPartitionedCall/model/linear_attention_head/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/linear_attention_head/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/model/linear_attention_head/Equal", "StatefulPartitionedCall/model/linear_attention_head/Cast", "StatefulPartitionedCall/model/linear_attention_head/truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/linear_attention_head/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/model/linear_attention_head/SelectV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/linear_attention_head/ArithmeticOptimizer/FoldTransposeIntoMatMul_MatMul_1", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/model/linear_attention_head/Softmax", "StatefulPartitionedCall/model/linear_attention_head/dense_1/Tensordot"], "attr": {"T": {"type": "DT_FLOAT"}, "adj_y": {"b": true}, "adj_x": {"b": false}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/model/linear_attention_head/ArithmeticOptimizer/FoldTransposeIntoMatMul_MatMul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 561}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/model/linear_attention_head/Equal", "shape": [1024, 64], "dtype": "bool"}, {"name": "StatefulPartitionedCall/model/linear_attention_head/Cast", "shape": [1024, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense/Tensordot/Const", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense/Tensordot/axes", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense/Tensordot/GatherV2_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense/Tensordot/Const_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense/Tensordot/ReadVariableOp", "shape": [1024, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/linear_attention_head/transpose/perm", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense/Tensordot/free", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense/Tensordot/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense/Tensordot/Const_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense/Tensordot/concat_1/axis", "shape": [], "dtype": "int32"}, {"name": "ConstantFolding/StatefulPartitionedCall/model/linear_attention_head/truediv_recip", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense_1/Tensordot/Const", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense_1/Tensordot/axes", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense_1/Tensordot/GatherV2_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense_1/Tensordot/Const_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense_1/Tensordot/ReadVariableOp", "shape": [1024, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/linear_attention_head/transpose_1/perm", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense_1/Tensordot/free", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense_1/Tensordot/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense_1/Tensordot/Const_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/linear_attention_head/dense_1/Tensordot/concat_1/axis", "shape": [], "dtype": "int32"}]}]}