{"format": "graph-model", "generatedBy": "2.4.1", "convertedBy": "TensorFlow.js Converter v3.3.0", "signature": {"inputs": {"input_29:0": {"name": "input_29:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1024"}, {"size": "64"}]}}, "input_30:0": {"name": "input_30:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1024"}, {"size": "64"}]}}, "input_28:0": {"name": "input_28:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1024"}, {"size": "64"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1024"}, {"size": "64"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/Equal", "op": "Const", "attr": {"dtype": {"type": "DT_BOOL"}, "value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {"dim": [{"size": "1024"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_18/Tensordot/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_18/Tensordot/axes", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_18/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_18/Tensordot/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_18/Tensordot/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_18/Tensordot/free", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_18/Tensordot/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_18/Tensordot/Const_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_18/Tensordot/concat_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/model_7/linear_attention_head_9/truediv_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_19/Tensordot/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_19/Tensordot/axes", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_19/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_19/Tensordot/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_19/Tensordot/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/transpose_1/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_19/Tensordot/free", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_19/Tensordot/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_19/Tensordot/Const_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_19/Tensordot/concat_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "input_28", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1024"}, {"size": "64"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_29", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1024"}, {"size": "64"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_30", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1024"}, {"size": "64"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/transpose", "op": "Transpose", "input": ["input_29", "StatefulPartitionedCall/model_7/linear_attention_head_9/transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/transpose_1", "op": "Transpose", "input": ["input_30", "StatefulPartitionedCall/model_7/linear_attention_head_9/transpose_1/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_18/Tensordot/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model_7/linear_attention_head_9/transpose"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_19/Tensordot/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model_7/linear_attention_head_9/transpose_1"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_18/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["StatefulPartitionedCall/model_7/linear_attention_head_9/dense_18/Tensordot/Shape", "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_18/Tensordot/axes", "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_18/Tensordot/GatherV2_1/axis"], "attr": {"Tparams": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_18/Tensordot/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/model_7/linear_attention_head_9/dense_18/Tensordot/Shape", "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_18/Tensordot/free", "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_18/Tensordot/GatherV2/axis"], "attr": {"Tparams": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_19/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["StatefulPartitionedCall/model_7/linear_attention_head_9/dense_19/Tensordot/Shape", "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_19/Tensordot/axes", "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_19/Tensordot/GatherV2_1/axis"], "attr": {"Tparams": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_19/Tensordot/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/model_7/linear_attention_head_9/dense_19/Tensordot/Shape", "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_19/Tensordot/free", "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_19/Tensordot/GatherV2/axis"], "attr": {"batch_dims": {"i": "0"}, "Tparams": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_18/Tensordot/Prod_1", "op": "Prod", "input": ["StatefulPartitionedCall/model_7/linear_attention_head_9/dense_18/Tensordot/GatherV2_1", "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_18/Tensordot/Const_1"], "attr": {"T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_18/Tensordot/Prod", "op": "Prod", "input": ["StatefulPartitionedCall/model_7/linear_attention_head_9/dense_18/Tensordot/GatherV2", "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_18/Tensordot/Const"], "attr": {"T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_18/Tensordot/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model_7/linear_attention_head_9/dense_18/Tensordot/GatherV2", "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_18/Tensordot/Const_2", "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_18/Tensordot/concat_1/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_19/Tensordot/Prod_1", "op": "Prod", "input": ["StatefulPartitionedCall/model_7/linear_attention_head_9/dense_19/Tensordot/GatherV2_1", "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_19/Tensordot/Const_1"], "attr": {"T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_19/Tensordot/Prod", "op": "Prod", "input": ["StatefulPartitionedCall/model_7/linear_attention_head_9/dense_19/Tensordot/GatherV2", "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_19/Tensordot/Const"], "attr": {"T": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_19/Tensordot/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model_7/linear_attention_head_9/dense_19/Tensordot/GatherV2", "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_19/Tensordot/Const_2", "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_19/Tensordot/concat_1/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_18/Tensordot/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model_7/linear_attention_head_9/dense_18/Tensordot/Prod", "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_18/Tensordot/Prod_1"], "attr": {"axis": {"i": "0"}, "N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_19/Tensordot/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model_7/linear_attention_head_9/dense_19/Tensordot/Prod", "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_19/Tensordot/Prod_1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_18/Tensordot/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/model_7/linear_attention_head_9/transpose", "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_18/Tensordot/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_19/Tensordot/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/model_7/linear_attention_head_9/transpose_1", "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_19/Tensordot/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_18/Tensordot/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/model_7/linear_attention_head_9/dense_18/Tensordot/Reshape", "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_18/Tensordot/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_19/Tensordot/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/model_7/linear_attention_head_9/dense_19/Tensordot/Reshape", "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_19/Tensordot/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_18/Tensordot", "op": "Reshape", "input": ["StatefulPartitionedCall/model_7/linear_attention_head_9/dense_18/Tensordot/MatMul", "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_18/Tensordot/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_19/Tensordot", "op": "Reshape", "input": ["StatefulPartitionedCall/model_7/linear_attention_head_9/dense_19/Tensordot/MatMul", "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_19/Tensordot/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/MatMul", "op": "BatchMatMulV2", "input": ["input_28", "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_18/Tensordot"], "attr": {"adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}, "adj_y": {"b": false}}}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/model_7/linear_attention_head_9/MatMul", "ConstantFolding/StatefulPartitionedCall/model_7/linear_attention_head_9/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/model_7/linear_attention_head_9/Equal", "StatefulPartitionedCall/model_7/linear_attention_head_9/Cast", "StatefulPartitionedCall/model_7/linear_attention_head_9/truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/model_7/linear_attention_head_9/SelectV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/ArithmeticOptimizer/FoldTransposeIntoMatMul_MatMul_1", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/model_7/linear_attention_head_9/Softmax", "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_19/Tensordot"], "attr": {"T": {"type": "DT_FLOAT"}, "adj_y": {"b": true}, "adj_x": {"b": false}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/model_7/linear_attention_head_9/ArithmeticOptimizer/FoldTransposeIntoMatMul_MatMul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 561}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/Equal", "shape": [1024, 64], "dtype": "bool"}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/Cast", "shape": [1024, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_18/Tensordot/Const", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_18/Tensordot/axes", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_18/Tensordot/GatherV2_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_18/Tensordot/Const_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_18/Tensordot/ReadVariableOp", "shape": [1024, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/transpose/perm", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_18/Tensordot/free", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_18/Tensordot/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_18/Tensordot/Const_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_18/Tensordot/concat_1/axis", "shape": [], "dtype": "int32"}, {"name": "ConstantFolding/StatefulPartitionedCall/model_7/linear_attention_head_9/truediv_recip", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_19/Tensordot/Const", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_19/Tensordot/axes", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_19/Tensordot/GatherV2_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_19/Tensordot/Const_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_19/Tensordot/ReadVariableOp", "shape": [1024, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/transpose_1/perm", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_19/Tensordot/free", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_19/Tensordot/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_19/Tensordot/Const_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_7/linear_attention_head_9/dense_19/Tensordot/concat_1/axis", "shape": [], "dtype": "int32"}]}]}